const compliments = [
    "Ты Самая Красивая в мире❤️",
    "Ты Моя Красавица❤️",
    "Ты Моя Умничка❤️",
    "Ты Моя Самая Самая Лучшая Девушка в Мире❤️",
    "Я Тебя Люблю❤️",
    "Менің Жаным❤️",
    "Менің Жүрегім❤️",
    "Менің Ханшайымым❤️",
    "Моя Любимая❤️",
    "Моя Госпожа❤️",
    "Ты такая интересная и удивительная❤️",
    "Ты такая сильная и умная❤️",
    "Ты Самая Самая❤️",
    "Моя Повелетильница❤️",
    "Ты такая Прекрасная❤️",
    "Ты сделала Мою Жизнь Лучше❤️",
    "Я так благодарен, что Ты в Моей Жизни❤️",
    "Твоя Улыбка Самая Красивая в Мире❤️",
    "Жүрегімнің Жарығы❤️",
    "Ең Әдемі Қыз❤️",
    "Ең Кушті Қыз❤️",
    "Сенің Көзіңнің Қарасы сондай Әдемі❤️",
    "Менің Айым❤️",
    "Менің Күнім❤️",
    "Моё солнышко❤️",
    "Моё Сердце❤️",
    "Менің Бақытым❤️",
    "Менің Махаббатым❤️",
    "Моя Любовь❤️",
    "Моя Девушка❤️",
    "Моя Любовь на Все Времена❤️",
    "Моя Любимая Девушка во Всём белом мире❤️"
];

function generateCompliment() {
    const randomIndex = Math.floor(Math.random() * compliments.length);
    document.getElementById("compliment-output").textContent = compliments[randomIndex];
}
